import { prisma } from "../src/lib/prisma"
import { RoleType } from "@prisma/client"

async function zeedQuestions(
    questions: Array<{
        id: string
        title: string
        answers: Array<string>
    }>,
    role: RoleType
) {
    for (const q of questions) {
        await prisma.question.create({
            data: {
                id: q.id,
                title: q.title,
                role,
                options: {
                    create: q.answers.map((text) => ({ option_text: text })),
                },
            },
        })
    }
}

async function main() {
    const participantQuestions = [
        {
            id: "QN1",
            title: "สนใจสายการเรียนไหนอยู่รึเปล่า?",
            answers: [
                "คณะสายวิทย์สุขภาพ",
                "คณะสายวิทย์กายภาพ",
                "คณะสายมนุษย์-สังคม",
            ],
        },
        {
            id: "QN2",
            title: "ทำไมถึงสนใจเรียนต่อจุฬาฯ?",
            answers: [
                "เกย์จุฬา",
                "มอท็อปประเทศมันเฟี้ยว",
                "เพราะน้ำใจน้องพี่สีชมพู",
                "อยากยิ่งใหญ่ อยากเป็นเศรษฐี",
                "ดูคอนเนคชั่นดี ดูมีโอกาสมากกว่า",
                "อยากไปเรียนไกลบ้านบ้าง เบื่อเชียงใหม่",
                "พ่อแม่อยากให้เรียน",
                "ยังไม่ตัดสินใจ แวะมาหาความรู้เฉย ๆ",
                "ไม่รู้ แค่ชอบสีชมพูเฉย ๆ",
                "ไม่รู้ ตามเพื่อน",
            ],
        },
        {
            id: "QN3",
            title: "เป็นคนประเภทไหนในห้อง?",
            answers: [
                "ตั้งใจเรียนสุด ๆ",
                "ต้นฉบับการบ้าน",
                "เข้าทุกคาบแต่ไม่ทราบอะไรเลย",
                "สายหลับ หลับตลอดเวลา",
                "แก๊งเกมเมอร์ ว่างแล้วต้องตี้",
                "อยู่เงียบ ๆ แบบประหยัดพลังงาน",
                "สายฮา ตบมุกโบ๊ะบ๊ะ",
                "บ้าพลัง ชอบเล่นกีฬา",
                "Extrovert รู้จักคนทั้งโรงเรียน",
                "สายกิจกรรม งานอะไรพี่ไปหมด",
                "รักสวยรักงามแบบ Slay Energy",
                "พกความฝันไว้ในสมุดวาดเขียน",
                "มาโรงเรียนเพื่อเจอเพื่อน เข้าสังคม",
                "(มา)สายเสมอต้นเสมอปลาย",
                "ดาว TikTok",
            ],
        },
        {
            id: "QN4",
            title: "ชอบอะไรโรงเรียนตัวเองที่สุด?",
            answers: [
                "เข้มแข็งด้านวิชาการ",
                "หลักสูตรหลายอย่างน่าสนใจ",
                "เพื่อน ๆ น่ารัก",
                "นักเรียนมีแต่คนหน้าตาดี",
                "คุณครูใจดี สอนสนุก",
                "โรงอาหารข้าวอร่อย",
                "กิจกรรมในโรงเรียนแบบปึ้ง",
                "เครื่องแบบนักเรียนเกร๋มาก",
                "บรรยากาศดี",
                "ห้องสมุดคือ Safe zone",
                "เดินทางง่าย",
                "เพื่อน/รุ่นพี่/รุ่นน้อง คนนั้น ><",
                "ไม่รู้เหมือนกัน คิดไม่ออก",
            ],
        },
        {
            id: "QN5",
            title: "งานอดิเรกที่ชอบทำในช่วงนี้?",
            answers: [
                "นอน",
                "อ่านหนังสือ/นิยาย/การ์ตูน",
                "ดูหนัง/ซีรีส์/อนิเมะ",
                "เล่นเกม",
                "เล่นกีฬา",
                "ดู Youtube",
                "ออกไปเที่ยว",
                "เป็นวัยรุ่น TikTok",
                "ฟังเพลง",
                "ทำงานศิลปะ",
                "ร้องเพลง",
                "คราฟต์งานเขียน",
                "ถ่ายภาพ",
                "เล่นดนตรี",
                "ทำอะไรพีค ๆ ที่นอกจากในนี้",
            ],
        },
        {
            id: "QN6",
            title: "ถ้าพรุ่งนี้โลกแตกจะทำอะไร?",
            answers: [
                "นอน",
                "ร้องไห้ก่อน",
                "ทำงานอดิเรกที่ชอบ",
                "ออกไปกินของอร่อย",
                "ซื้อทุกอย่างที่อยากซื้อ",
                "สารภาพรักกับคนที่ชอบ",
                "ใช้เวลาอยู่กับแฟน",
                "ใช้เวลาอยู่กับเพื่อน",
                "ใช้เวลาอยู่กับครอบครัว",
                "ชิว แล้วผมจะไปแคร์(เห้)ไร",
                "ไปที่ ๆ อยากไป",
                "เคลียร์ทุกอย่างที่อยากทำแต่ไม่กล้า",
                "แกล้งบ้าดีกว่าพรี่",
            ],
        },
    ]
    const staffQuestions = [
        {
            id: "QS1",
            title: "คิดยังไงกับคณะที่เรียนอยู่?",
            answers: [
                "สนุกมากกกกก",
                "เฉย ๆ อยู่ได้ ได้อยู่",
                "เรียนหนักแต่ไหว",
                "หนี F",
                "อยากลาออกทุกวัน",
            ],
        },
        {
            id: "QS2",
            title: "ทำไมถึงเลือกเรียนจุฬาฯ?",
            answers: [
                "เกย์จุฬา",
                "มอท็อปประเทศมันเฟี้ยว",
                "เพราะน้ำใจน้องพี่สีชมพู",
                "อยากยิ่งใหญ่ อยากเป็นเศรษฐี",
                "ดูคอนเนคชั่นดี ดูมีโอกาสมากกว่า",
                "อยากไปเรียนไกลบ้านบ้าง เบื่อจังหวัดตัวเอง",
                "พ่อแม่อยากให้เรียน",
                "ไม่รู้ แค่ชอบสีชมพูเฉย ๆ",
                "ไม่รู้ ตามเพื่อน",
            ],
        },
        {
            id: "QS3",
            title: "ทำไมถึงมาค่ายจุฬา-เชียงใหม่?",
            answers: [
                "อยากลองทำอะไรใหม่ ๆ",
                "เพื่อนชวน",
                "อยากมาเที่ยวเชียงใหม่",
                "อยากทำค่ายอยู่แล้ว",
                "เคยมาค่ายนี้ พอขึ้นมหาลัยเลยมาช่วย",
            ],
        },
        {
            id: "QS4",
            title: "อยากมีพลังวิเศษอะไรมากที่สุด?",
            answers: [
                "เป็นอมตะ",
                "รู้อดีต รู้อนาคต",
                "ลอยได้",
                "อ่านใจคน",
                "ฟังพูดอ่านเขียนได้ทุกภาษาบนโลก",
                "วาร์ปได้แบบไม่จำกัดระยะทาง",
                "ย้อนเวลา/หยุดเวลา",
                "มีพลังรักษาคนแบบ Healer",
                "ใช้เวทย์มนตร์",
                "คุยกับสัตว์",
            ],
        },
        {
            id: "QS5",
            title: "สถานะในตอนนึ้?",
            answers: [
                "ยังโสด โสด อยู่ทางนี้ยังโสด โสด",
                "มีแฟนแล้ว รักแฟนมาก",
                "กำลังพบเจอมรสุมชีวิต แต่พรี่ไหวอยู่(ไม่)",
                "ถึงตัวจะเป็นผู้ใหญ่ แต่สมองยังเป็นเด็ก",
                "กำลังเดินทางอยู่",
                "รู้สึกไม่อยากโตเป็นผู้ใหญ่",
                "สบายดี ชีวิตแฮปปี้ มีความสุข",
                "เฉย ๆ ไม่แย่ อยู่ได้",
                "อธิษฐานให้โลกแตกทุกวัน",
            ],
        },
        {
            id: "QS6",
            title: "ถ้าวันนั้นไม่ติดจุฬาจะทำยังไง?",
            answers: [
                "ร้องไห้ก่อน อย่างอื่นค่อยว่ากัน",
                "ยังไงก็ติดอยู่แล้ว เก่ง มั่นใจ ไม่กลัว",
                "ไปเรียนมหาลัยอื่นก็ได้ งอน",
                "ซิ่ว ฉันจะเป็นเด็กจุฬาฯให้ได้เลย!",
            ],
        },
        {
            id: "QS7",
            title: "ในค่ายนี้อยู่ฝ่ายอะไร?",
            answers: [
                "กิจกรรม",
                "ทะเบียน",
                "พี่กลุ่ม",
                "พยาบาล",
                "พิธีการ",
                "วิชาการ",
                "สถานที่",
                "สวัสดิการ-พัสดุ",
                "สันทนาการ",
                "แสงเสียง",
                "หาทุน",
                "PR",
                "Production",
                "Creative",
                "เหรัญญิก",
                "เลขา",
                "ประธาน",
            ],
        },
    ]

    console.log(`🚀 Zeeding participantQuestions`)
    await zeedQuestions(participantQuestions, RoleType.PARTICIPANT)

    console.log(`🚀 Zeeding staffQuestions`)
    await zeedQuestions(staffQuestions, RoleType.STAFF)
}
main()
    .then(async () => {
        await prisma.$disconnect()
    })
    .catch(async (e) => {
        console.error(e)
        await prisma.$disconnect()
        process.exit(1)
    })
